import React from "react";
import Footer from "../components/footer";
import Header from "../components/header";

export default () => (
  <div>
    <Header title="分散型ソーシャルネットワーキングサービス 共通利用条件" />
    <h3>第1条 総則</h3>
    <p>
      この利用条件(以下「本規約」といいます。)は、合同会社分散型ソーシャルネットワーク機構(以下「当社」といいます。)が運営する分散型ソーシャルネットワーキングサービス(以下「本サービス」といいます。)及び本サービスに付随してその他当社の運用するブログ、Twitter、Facebook、メールマガジン等の媒体において提供される様々な情報やサービス(以下これらを総称して「本サービス等」といいます。)の共通利用条件を定めるものです。
      <br />
      すべてのユーザーは、本サービス等にアクセスすることにより、本規約に合意したものとみなされます。本規約をよく読んで本サービス等を利用してください。
      <br />
      なお、各サービスで個別の利用規約が定められている場合、個別の利用規約を優先します。
    </p>
    <h3>第2条 定義</h3>
    <p>
      本規約において使用する用語は、本規約の他の箇所に定められるもののほか、以下の通りの意味をもつものとします。{" "}
    </p>
    <ol>
      <li>
        「登録ユーザー」
        -当社が定める方法により、本サービスへの登録を申し込んだ方をいいます。なお、本サービスを利用する場合には、本規約、プライバシーポリシーおよび各インスタンスのルールへの同意とユーザー登録が必要です。{" "}
      </li>
      <li>
        「登録情報」
        -ユーザー登録を受けるためにユーザーが当社に提供した情報をいいます。{" "}
      </li>
      <li>
        「個人情報」
        -登録情報のうち、氏名、電子メールアドレス、その他特定の個人を識別できる情報をいいます。{" "}
      </li>
      <li>
        「インスタンス」
        -本サービスのうち、個別のソーシャルネットワーキングサービスのことをいいます。{" "}
      </li>
    </ol>
    <h3>第3条 本サービスの内容</h3>
    <p>本サービスは、以下の内容で構成されています。</p>
    <ol>
      <li>分散型ソーシャルネットワーキングサービス「mstdn.jp」</li>
      <li>分散型ソーシャルネットワーキングサービス「mastodon.cloud」</li>
    </ol>
    <h3>第4条 ユーザー登録</h3>
    <ol>
      <li>
        登録希望者は、本人自身で当社の定める方法により登録を行うものとします。{" "}
      </li>
      <li>
        当社は、登録希望者が、以下の各号のいずれかの事由に該当する場合は、登録および再登録を拒否する場合があります。当社は、登録または再登録を拒否をした場合であっても、その理由について一切開示義務を負わないものとします。{" "}
      </li>
      <ol>
        <li>
          当社に提供した登録事項の全部または一部につき虚偽、誤記または記載漏れがあると当社が判断した場合{" "}
        </li>
        <li>
          親権者の同意を得られていない15歳未満の登録申請であると当社が判断した場合{" "}
        </li>
        <li>
          反社会的勢力等である、または資金提供その他を通じて反社会的勢力等の維持、運営もしくは経営に協力もしくは関与する等反社会的勢力等との何らかの関与を行っていると当社が判断した場合{" "}
        </li>
        <li>
          過去当社との契約に違反したことがある登録希望者またはその関係者であると当社が判断した場合{" "}
        </li>
        <li>禁止事項に定める措置を受けたことがある場合</li>
        <li>その他、当社が登録を適当でないと判断した場合</li>
      </ol>
      <li>
        登録ユーザーは、ユーザー登録の解除を希望する場合には、当社指定の方法により、ユーザー登録を解除することができます。ただし、過去の投稿内容等について、当社は削除する責任を負わないものとします。{" "}
      </li>
      <li>
        登録ユーザーには、本規約およびプライバシーポリシーの他に各インスタンスのルールが適用されます。{" "}
      </li>
    </ol>
    <h3>第5条 ユーザーアカウントおよびパスワードの管理</h3>
    <ol>
      <li>
        当社は登録ユーザーに対して、本サービス等の機能の使用のために必要なアカウントおよびパスワードを付与するものとします。登録ユーザーは、アカウントおよびパスワード並びにこれらを利用した本サービス等の利用に関する一切の責任を負うものとします。{" "}
      </li>
      <li>
        登録ユーザーは、アカウントおよびパスワード並びに本サービス等の利用に関する権利義務につき、第三者に対し譲渡その他の処分をしてはならないものとします。当社は、第三者が登録ユーザーのアカウントまたはパスワードを使用したことにより登録ユーザーが被るいかなる損害、損失または費用(以下「損害等」といいます。)も補償いたしません。{" "}
      </li>
      <li>
        登録ユーザーは、パスワードが第三者に漏れた場合、あるいはパスワードが第三者に使用されている疑いのある場合には、直ちに当社にその旨連絡するとともに、当社の指示がある場合にはこれに従うにものとします。この場合、当社はそのパスワード等を不正アカウントとして停止することができるものとします。{" "}
      </li>
      <li>
        登録ユーザーは、本サービス等が登録ユーザーに対して発行するアカウントまたはパスワードを、第三者に開示してはなりません。{" "}
      </li>
      <li>
        登録ユーザーは、定期的にパスワードを変更するものとします。パスワードの変更を怠ったことにより損害等が生じても、当社は一切の責任を負いません。{" "}
      </li>
    </ol>
    <h3>第6条 届出事項の変更等</h3>
    <ol>
      <li>
        登録ユーザーは、登録情報に変更が生じた場合には、直ちに当社に変更を連絡するものとします。{" "}
      </li>
      <li>
        ユーザーは本サービス等の機能を使い、自ら最新の情報を登録するものとし、当社からのユーザーに対する通知は、ユーザーが当社に申請した連絡先に発信することにより、ユーザーに通常到達すべきときに到達したとみなされるものとします。{" "}
      </li>
    </ol>
    <h3>第7条 個人情報の取扱い</h3>
    <ol>
      <li>
        当社によるユーザー情報の取扱いについては、当社プライバシーポリシーの定めによるものとし、ユーザーはこのプライバシーポリシーに従って当社がユーザー情報を取扱うことについて同意するものとします。{" "}
      </li>
      <li>
        当社は、ユーザーが当社に提供した情報、データ等を、個人を特定できない形での統計的な情報として、当社の裁量で、利用および公開することができるものとし、ユーザーはこれに異議を唱えないものとします。{" "}
      </li>
    </ol>
    <h3>第8条 本サービス等の変更、停止、および廃止</h3>
    <ol>
      <li>
        当社は、いつでも本サービスの内容を事前の告知なく、変更または廃止することができるものとし、これによりユーザーに生じた損害等には一切責任を負いません。当社は、本サービスの変更または廃止に際しては、事前に電子メールまたは本サービスサイト等によりユーザーにその旨を通知するよう努めるものとします。{" "}
      </li>
      <li>
        当社は、次の事由により本サービスの一部または全部を停止することができるものとし、これによりユーザーに生じた損害等には一切責任を負いません。{" "}
      </li>
      <ol>
        <li>
          本サービスの提供のための装置、システムの保守または点検を行う場合
        </li>
        <li>
          火災、停電、地震、天災、システム障害等により、本サービスの運営が困難な場合{" "}
        </li>
        <li>その他、当社がやむをえないと判断した場合</li>
      </ol>
    </ol>
    <h3>第9条 禁止行為</h3>
    <ol>
      <li>
        ユーザーは、本サービス等の利用にあたって、以下のいずれかに該当する行為あるいはそのおそれがある行為をしてはならないものとします。{" "}
      </li>
      <ol>
        <li>法令に違反する行為または犯罪行為に関連する行為</li>
        <li>
          当社、本サービス等の他のユーザーまたはその他の第三者に対する詐欺または脅迫行為{" "}
        </li>
        <li>公序良俗に反する行為</li>
        <li>
          当社、本サービス等の他のユーザーまたはその他の第三者の知的財産権、肖像権、プライバシーの権利、名誉、その他の権利または利益を侵害する行為{" "}
        </li>
        <li>
          本サービス等を通じ、以下に該当し、または該当すると当社が判断する情報を当社または本サービス等の他のユーザーに送信すること{" "}
        </li>
        <ol>
          <li>過度に暴力的または残虐な表現を含む情報</li>
          <li>
            コンピューター・ウィルスその他の有害なコンピューター・プログラムを含む情報{" "}
          </li>
          <li>
            当社、本サービス等の他のユーザーまたはその他の第三者の名誉または信用を毀損する表現を含む情報・過度にわいせつな表現を含む情報{" "}
          </li>
          <li>
            差別を助長する表現を含む情報・自殺、自傷行為を助長する表現を含む情報{" "}
          </li>
          <li>薬物の不適切な利用を助長する表現を含む情報</li>
          <li>反社会的な表現を含む情報</li>
          <li>他人に不快感を与える表現を含む情報</li>
          <li>売買春等の違法行為を目的とした情報</li>
          <li>
            本サービス等のネットワークまたはシステム等に過度な負荷をかける行為{" "}
          </li>
          <li>本サービス等の運営を妨害するおそれのある行為</li>
          <li>
            当社のネットワークまたはシステム等に不正にアクセスし、または不正なアクセスを試みる行為{" "}
          </li>
          <li>第三者に成りすます行為</li>
          <li>
            本サービス等の他のユーザーのアカウントまたはパスワードを利用する行為{" "}
          </li>
          <li>
            不特定多数へのダイレクトメール若しくはリプライ機能を用いた本サービス上での宣伝、広告、勧誘、または営業行為{" "}
          </li>
          <li>
            当社、本サービスの他のユーザーまたはその他の第三者に不利益、損害、不快感を与える行為{" "}
          </li>
          <li>各インスタンスのルールに抵触する行為</li>
          <li>反社会的勢力等への利益供与</li>
          <li>前各号の行為を直接または間接に惹起し、または容易にする行為</li>
          <li>その他、当社が不適切と判断する行為</li>
        </ol>
      </ol>
      <li>
        ユーザーが本規約および各インスタンスのルールに違反することにより、当社が損害等を被った場合、当社はユーザーに対して損害等の補償を請求できるものとします。{" "}
      </li>
    </ol>
    <h3>第10条 当社の責任範囲</h3>
    <ol>
      <li>
        当社は、ユーザーが本サービス等を利用する際に、コンピュータウイルスなど有害なプログラム等による損害を受けないことを保証しないものとします。{" "}
      </li>
      <li>
        当社は、ユーザーが本サービス等を利用する際に使用するいかなる機器、ソフトウェアについても、その動作保証を一切しないものとします。{" "}
      </li>
      <li>
        当社は、ユーザーが本サービス等を利用する際に発生する通信費用について、一切負担しないものとします。{" "}
      </li>
      <li>
        当社は、いかなる場合でも、ユーザーの逸失利益、間接損害、特別損害、拡大損害、弁護士費用その他の本条に規定のない損害等を賠償しないものとします。{" "}
      </li>
      <li>
        本サービス等上においてユーザーが開示した、テキスト、コード、スニペット、音声、動画、画像および画像に付随する情報や個人情報などを含む全ての情報に関する責任は、ユーザー各自にあります。従って、当社はユーザーが本サービス等において開示した情報の内容について、一切の責任を負いません。{" "}
      </li>
      <li>
        ユーザーが他人の名誉を毀損した場合、プライバシー権を侵害した場合、著作権法に違反する行為を行った場合、その他他人の権利を侵害した場合、当該ユーザーは自身の責任と費用において解決しなければならず、当社は一切の責任を負いません。{" "}
      </li>
      <li>
        ユーザーが、他者及びユーザー自身が本サービス等上に投稿、コメントした情報及び画像・映像等の使用によって不利益が生じた場合、当該ユーザー自身に責任があるものとし、当社は一切の責任を負いません。{" "}
      </li>
      <li>
        ユーザーが開示した情報が原因となって迷惑を受けたとする者が現れた場合には、当該ユーザーは自身の責任と費用において解決しなければならず、当社は一切の責任を負いません。{" "}
      </li>
    </ol>
    <h3>第11条 ユーザー資格の停止・除名</h3>
    <p>
      当社は、登録ユーザーにつき以下の事由がある場合、何ら事前の通知または催告をすることなく、そのユーザーの投稿データを削除し、または本サービス等の利用を一時停止しもしくは除名することができるものとします。{" "}
    </p>
    <ol>
      <li>
        アカウント、パスワードまたは本サービス等を不正に使用しまたは使用させた場合{" "}
      </li>
      <li>
        その他、登録ユーザーが本規約および各インスタンスのルールのいずれかまたは双方の条項に違反した場合{" "}
      </li>
      <li>その他、登録ユーザーとして不適格と当社が判断した場合</li>
    </ol>
    <h3>第12条 分離可能性</h3>
    <p>
      本規約のいずれかの条項またはその一部が、消費者契約法その他の法令等により無効または執行不能と判断された場合であっても、本規約の残りの規定および一部が無効または執行不能と判断された規定の残りの部分は、継続して完全に効力を有するものとします。{" "}
    </p>
    <h3>第13条 サービス利用契約上の地位の譲渡等</h3>
    <ol>
      <li>
        ユーザーは、本規約上の地位または本規約に基づく権利もしくは義務につき、第三者に対し、譲渡、移転、担保設定その他の処分をすることが可能です。なお、譲渡、移転、担保設定その他の処分を行った場合、譲渡先の第三者は当規約、プライバシーポリシー及び各インスタンスのルールに同意したものとみなします。また、譲渡、移転、担保設定その他の処分に伴い、ユーザー及び第三者に生じた損害等について、当社は一切責任を負いません。{" "}
      </li>
      <li>
        当社は本サービス等に係る事業を他社に譲渡した場合(合併、会社分割、事業譲渡その他様式を問いません。)には、当該譲渡に伴いユーザーの本規約上の地位、本規約に基づく権利ならびに義務および登録情報その他の顧客情報の一切を譲受人に譲渡することができるものとし、ユーザーは、かかる譲渡につき本項によりあらかじめ同意します。{" "}
      </li>
    </ol>
    <h3>第14条 連絡・通知</h3>
    <p>
      本サービス等に関する問い合わせその他ユーザーから当社に対する連絡または通知、および本規約の変更に関する通知その他当社からユーザーに対する連絡は、当社の定める方法で行うものとします。{" "}
    </p>
    <h3>第15条 ユーザーによる投稿内容の取扱い</h3>
    <ol>
      <li>
        ユーザーは、本サービス等を利用して本サイト上に投稿した投稿、コメント、公開プロフィールの自己紹介などのテキストデータ、および画像や動画・音声ファイルなどの投稿テキストに付随的に投稿されたデータ(以下「投稿内容」といいます。)について、自らが投稿又は送信することについての適法な権利を有していること、及び投稿内容が第三者の権利を侵害しないことについて、表明し、保証するものとします。{" "}
      </li>
      <li>
        ユーザーは、当社及び、本サービス等と接続する分散型ソーシャルネットワーキングサービス及びその他のサービスの運営者に対し、投稿内容について無償にて利用(複製、複写、改変、第三者への再許諾その他のあらゆる利用を含む。)する権利を許諾するものとします。本項に基づく、ユーザーの当社への利用許諾の範囲には、本サービス等を通じて、当社が他のユーザーに対して投稿内容の利用を再許諾することも含むものとします。{" "}
      </li>
      <li>
        前項の利用許諾には、地域制限、著作権表示義務その他付随条件はないものとし、ユーザーの当社に対する利用許諾の期間は、ユーザーが本サービス等の利用資格を失った後においても、投稿内容の知的財産権が存続する限り継続するものとします。{" "}
      </li>
      <li>
        当社は、投稿内容を当社又は第三者のウェブサイト等において利用及び公開する場合があります。この場合、当社は、投稿内容について、要約、抜粋、サイズ変更又は切り抜きなどの改変等の行為を行う場合があります。また、ユーザーは、当社が投稿内容を利用する場合には、ユーザーが投稿又は送信した際のユーザーIDその他の登録事項を表示する場合があることを予め了承するものとします。{" "}
      </li>
      <li>
        当社、ユーザー、その他の第三者が投稿内容を利用したことによってユーザーに生じた損害については、当社では一切の補償をいたしません。{" "}
      </li>
      <li>
        当社は投稿内容を当社の裁量で自由に保存することができるものとし、当社が必要と認めた場合には、投稿者の承諾を得ることなく、保存されている投稿内容の削除または修正を行う場合があります。ユーザーはこれについて一切の異議をとなえないものとします。{" "}
      </li>
    </ol>
    <h3>第16条 投稿内容の権利帰属</h3>
    <ol>
      <li>
        投稿内容の著作権等の扱いについては、以下の各号に定めるとおりとします。{" "}
      </li>
      <ol>
        <li>
          ユーザーは、自身が投稿した投稿内容に記録されている内容に関する一切の特許権、商標権、企業秘密、著作権若しくはその他の財産権および個人情報を含むプライバシー権、肖像権などの諸権利について保有するか、または、当社をして本項第3号に定められる投稿内容の利用をさせるのに必要なライセンス、権利、同意及び許可を有していることを保証するものとします。万一、第三者との間で何らかの紛争が発生した場合には、ユーザーの費用と責任において問題を解決するとともに、当社に何等の迷惑または損害を与えないものとします。{" "}
        </li>
        <li>投稿内容の著作権等は、当該投稿をしたユーザーに帰属します。</li>
        <li>
          当社は、本サービス等の円滑な提供、利用促進等に必要な範囲内で、無償かつ非独占的に使用及び改変等をすることができるものとし、ユーザーはこれを許諾するものとします。また、第三者の運営する分散型ソーシャルネットワーキングサービスによって使用及び改変等が行われることを了承するものとします。{" "}
        </li>
      </ol>
      <li>
        当社は、自らまたは第三者をして、前項に基づく許諾に基づき、投稿内容の表示、編集、複製、転載、配布、公衆送信などを行う場合でも、当社はユーザーの氏名、ユーザーIDおよびハンドルネーム、その他のユーザーを表象する名称および情報を表示し、又は表示しないことができるものとします。{" "}
      </li>
      <li>
        投稿内容の利用について、利用者および第三者に損害が発生したとしても、当社は一切責任を負わないものとします。{" "}
      </li>
    </ol>
    <h3>第17条 ユーザーに関する情報の利用</h3>
    <p>
      当社は、本サービス等申込時にユーザーが登録したユーザー情報を、ユーザー個人を特定できない利用形態において、当社の裁量で自由に利用又は第三者に開示することができるものとします。{" "}
    </p>
    <h3>第18条 外部サービス</h3>
    <ol>
      <li>
        本サービス等は、第三者の提供する分散型ソーシャルネットワーキングサービス、Twitter、Facebook、GitHub等の外部サービス(以下「外部サービス」といいます。)と連携してサービスを提供することがありますが、ユーザーは、自らの責任において外部サービスを利用するものとし、当社は、外部サービスの利用に関連してユーザーに発生した損害について、一切の責任を負いません。{" "}
      </li>
      <li>
        ユーザーは、外部サービスの利用に当たっては、外部サービスの利用規約等を遵守するものとします。{" "}
      </li>
      <li>
        ユーザーは、投稿内容その他の情報が、外部サービスに投稿されることを予め承認するものとします。また、当社は、外部サービスに投稿された投稿内容について、削除等を行う義務を負わないものとします。{" "}
      </li>
    </ol>
    <h3>第19条 契約終了後の取扱い</h3>
    <p>
      当社は、ユーザーが本サービス等の利用を終了した場合及び当社が本サービス等を廃止したことなど、何らかの理由によりユーザーが本サービス等の利用資格を失った後においても、第9条から第11条は有効に存続し、ユーザーが登録したユーザー情報及び投稿内容を使用することができるものとします。{" "}
    </p>
    <h3>第20条 広告の配信及び解析等</h3>
    <ol>
      <li>
        当社は、本サービス等において、ユーザーの動向を調査する為にCookie等により、匿名の統計的な利用情報を取得する場合があります。{" "}
      </li>
      <li>
        当社は、本サービス等上において、当社の裁量に基づいて、本規約に従って広告を掲載することができるものとし、ユーザーはこれを予め承諾するものとします。{" "}
      </li>
    </ol>
    <h3>第21条 準拠法および合意管轄</h3>
    <ol>
      <li>本規約の準拠法は日本法とし、日本法に従い解釈されるものとします。</li>
      <li>
        本規約に関して紛争が生じた場合、横浜地方裁判所を第一審の専属的合意管轄裁判所とします。{" "}
      </li>
    </ol>
    <h3>第22条 利用規約の変更</h3>
    <p>
      当社は、必要に応じて随時、本規約を改定できるものとし、本規約を改定する場合は、改定後の規約を掲載するとともに、規約の改定につき当社のウェブサイトの分かりやすい場所にお知らせします。改定後の規約を掲載後に本サービス等にアクセスしたユーザーは、改定後の規約に同意したものとして取り扱われ、改定後の規約が適用されるものとします。{" "}
    </p>
    <Footer />
  </div>
);
