import React from "react";
import Footer from "../components/footer";
import Header from "../components/header";

export default () => (
  <div>
    <Header title="共通プライバシーポリシー" />
    <p>
      合同会社分散型ソーシャルネットワーク機構（以下「当社」といいます。）は、当社の提供するサービス（以下「本サービス」といいます。）における、ユーザーについての個人情報を含む利用者情報について、細心の注意を払って慎重に取り扱い、利用および共有させていただいております。
      <br />
      このプライバシーポリシー（以下「本ポリシー」といいます。）は、当社の個人情報を含む利用者情報についての取扱方針を説明するものです。
      <br />
      当社の提供する本サービスをご利用いただいた場合、本ポリシーに同意していただいたものとみなされます。
    </p>
    <h3>【取得する情報及び収集方法について】</h3>
    <p>
      本ポリシーにおいて、「利用者情報」とは、ユーザーの識別に係る情報、ユーザーの通信
      <br />
      サービス上の行動履歴に関する情報、ユーザーの状態に関する情報、その他ユーザーのスマートフォン、PC等の端末においてユーザーの情報と結びついた形で生成、利用又は蓄積された情報であって、本ポリシーに基づき当社が収集するものを意味するものとします。
      <br />
      本サービスにおいて当社が収集する利用者情報は、その収集方法に応じて、以下のようなものとなります。
    </p>
    <ul>
      <li>
        IPアドレス・ユーザーが自ら入力したメールアドレス、住所、電話番号、氏名・クッキー技術を用いて生成された識別情報{" "}
      </li>
      <li>GPS機器によって計測される位置情報、基地局に送信される位置登録情報</li>
    </ul>
    <h3>【取得する情報の取得目的について】</h3>
    <p>
      当社サービスにおいて取得する利用者情報の取得目的は、以下のとおりです。
    </p>
    <ol>
      <li>SNSにおける以下の目的</li>
      <ul>
        <li>分散型SNSの提供をするため</li>
        <li>ユーザーへのサポートに利用するため</li>
        <li>他のユーザーに対して迷惑となる行為等への対応のため</li>
        <li>サーバーに過度な負荷をかける行為等への対応のため</li>
        <li>ユーザー交流会等のイベント運営のため</li>
        <li>ダウンロードコンテンツ</li>
        <li>ノベルティグッズの販売における発送業務のため</li>
        <li>当社が提供する各サービスの集客のための統計分析のため</li>
        <li>最適な広告を掲載するため</li>
      </ul>
      <li>コーポレートサイトにおける以下の目的</li>
      <ul>
        <li>お問い合わせにご入力頂いた内容のご対応及びご提案のため</li>
        <li>今後の当社からのご紹介・ご案内のため</li>
        <li>当社が提供する各サービスの集客のための統計分析</li>
      </ul>
      <li>Webメディアにおける以下の目的</li>
      <ul>
        <li>ユーザーへのサポートに利用するため</li>
        <li>当社が提供する各サービスの集客のための統計分析</li>
        <li>最適な広告を掲載するため</li>
      </ul>
      <li>ユーティリティソフトウェアにおける以下の目的</li>
      <ul>
        <li>不具合、クラッシュ情報の収集のため</li>
        <li>ユーザーへのサポートに利用するため</li>
        <li>当社が提供する各サービスの集客のための統計分析</li>
        <li>最適な広告を掲載するため</li>
      </ul>
    </ol>
    <h3>【外部送信等について】</h3>
    <p>
      利用者情報を利用したターゲティング広告の配信のため、以下のツールにより第三者に利用者情報を提供し、統計的に処理を行います。{" "}
    </p>
    <ul>
      <li>GoogleAnalytics (Google社提供)</li>
      <li>GoogleAdSense (Google社提供)</li>
      <li>GoogleAdWords (Google社提供)</li>
      <li>Yahoo!プロモーション広告 (Yahoo!Japan提供)</li>
      <li>Yahooアクセス解析 (Yahoo!Japan及びユーザーローカル提供)</li>
      <li>Facebook広告 (Facebook社提供)</li>
      <li>Twitter広告 (Twitter社提供)</li>
      <li>Fabric (Google社提供)</li>
      <li>Firebase (Google社提供)</li>
    </ul>
    <p>以下の各アプリストア</p>
    <ul>
      <li>GooglePlay</li>
      <li>AppStore</li>
      <li>Amazonアプリストア</li>
    </ul>
    <h3>【個人情報の第三者提供について】</h3>
    <p>
      当社は、利用者情報のうち、個人情報については、個人情報保護法その他の法令に基づき開示が認められる場合を除くほか、あらかじめユーザーの同意を得ないで、第三者に提供しません。
      <br />
      但し、次に掲げる場合はこの限りではありません。
    </p>
    <ul>
      <li>
        当社が利用目的の達成に必要な範囲内において個人情報の取り扱いの全部又は一部を委託する場合{" "}
      </li>
      <li>合併その他の事由による事業の承継に伴って個人情報が提供される場合</li>
      <li>
        前項【外部送信等について】の定めに従って、利用者情報が提供される場合
      </li>
      <li>
        国の機関若しくは地方公共団体又はその委託を受けたものが法令の定める事務を遂行することに対して協力する必要がある場合であって、ユーザーの同意を得ることによって当該事務の遂行に支障を及ぼす恐れがある場合{" "}
      </li>
      <li>その他、個人情報保護法その他の法令で認められる場合</li>
    </ul>
    <h3>【下請業者に業務委託する業務】</h3>
    <p>
      当社が下請け業者に業務委託をする場合のある業務については、以下のとおりです。{" "}
    </p>
    <ul>
      <li>システム開発</li>
      <li>Web・アプリデザイン</li>
      <li>イベント運営代行</li>
      <li>ノベルティグッズの発送・運送</li>
      <li>SNS投稿監視業務</li>
      <li>SNS投稿通報対応</li>
    </ul>
    <h3>【利用者情報の共同利用について】</h3>
    <p>
      当社のサービスを提供するにあたり、当社と共同して業務を行うビジネスパートナーが必要な場合には、ユーザーの個人情報をそのビジネスパートナーと共同利用することがあります。
      <br />
      この場合に当社は、利用目的、ビジネスパートナーの名称、情報の種類、管理者の名称についてユーザーに公表した上で共同利用することと致します。
    </p>
    <h3>【本ポリシーの改定について】</h3>
    <p>
      当社は本ポリシーを、法令変更への対応の必要性および事業上の必要性等に応じて、随時、変更及び改正する場合があります。
      <br />
      変更等については、このウェブサイト上に掲載致します。ユーザーは、このウェブサイト上に掲載される変更等の後の最新の本方針の内容を十分にご確認ください。
    </p>
    <h3>【お問い合わせについて】</h3>
    <p>
      本ポリシーに関してご不明な点がある場合、本サービスにおける個人情報の取り扱いに関するご質問・苦情・ご相談等があります場合は{" "}
      <a href="https://ws.formzu.net/fgen/S85651644">こちら</a>
      のフォームよりご連絡ください。
    </p>
    <Footer />
  </div>
);
